tukano-artillery-tests/logs/delete-postgres-15.txt
--------------------------------
Summary report @ 17:16:18(+0000)
--------------------------------

errors.ETIMEDOUT: .............................................................. 98
http.codes.200: ................................................................ 352
http.downloaded_bytes: ......................................................... 30658
http.request_rate: ............................................................. 15/sec
http.requests: ................................................................. 450
http.response_time:
  min: ......................................................................... 426
  max: ......................................................................... 3428
  mean: ........................................................................ 917.3
  median: ...................................................................... 539.2
  p95: ......................................................................... 2515.5
  p99: ......................................................................... 2951.9
http.response_time.2xx:
  min: ......................................................................... 426
  max: ......................................................................... 3428
  mean: ........................................................................ 917.3
  median: ...................................................................... 539.2
  p95: ......................................................................... 2515.5
  p99: ......................................................................... 2951.9
http.responses: ................................................................ 352
plugins.metrics-by-endpoint./rest/users/{{ userId }}?pwd=pwd.codes.200: ........ 352
plugins.metrics-by-endpoint./rest/users/{{ userId }}?pwd=pwd.errors.ETIMEDOUT: . 98
plugins.metrics-by-endpoint.response_time./rest/users/{{ userId }}?pwd=pwd:
  min: ......................................................................... 426
  max: ......................................................................... 3428
  mean: ........................................................................ 917.3
  median: ...................................................................... 539.2
  p95: ......................................................................... 2515.5
  p99: ......................................................................... 2951.9
vusers.completed: .............................................................. 352
vusers.created: ................................................................ 450
vusers.created_by_name.DB Storage: ............................................. 450
vusers.failed: ................................................................. 98
vusers.session_length:
  min: ......................................................................... 850.3
  max: ......................................................................... 9994.5
  mean: ........................................................................ 3272
  median: ...................................................................... 982.6
  p95: ......................................................................... 9230.4
  p99: ......................................................................... 9801.2