tukano-artillery-tests/logs/delete-postgres-33.txt
--------------------------------
Summary report @ 17:20:04(+0000)
--------------------------------

errors.ETIMEDOUT: .............................................................. 10
http.codes.200: ................................................................ 980
http.downloaded_bytes: ......................................................... 85922
http.request_rate: ............................................................. 27/sec
http.requests: ................................................................. 990
http.response_time:
  min: ......................................................................... 419
  max: ......................................................................... 8927
  mean: ........................................................................ 2413.5
  median: ...................................................................... 2059.5
  p95: ......................................................................... 5944.6
  p99: ......................................................................... 7260.8
http.response_time.2xx:
  min: ......................................................................... 419
  max: ......................................................................... 8927
  mean: ........................................................................ 2413.5
  median: ...................................................................... 2059.5
  p95: ......................................................................... 5944.6
  p99: ......................................................................... 7260.8
http.responses: ................................................................ 980
plugins.metrics-by-endpoint./rest/users/{{ userId }}?pwd=pwd.codes.200: ........ 980
plugins.metrics-by-endpoint./rest/users/{{ userId }}?pwd=pwd.errors.ETIMEDOUT: . 10
plugins.metrics-by-endpoint.response_time./rest/users/{{ userId }}?pwd=pwd:
  min: ......................................................................... 419
  max: ......................................................................... 8927
  mean: ........................................................................ 2413.5
  median: ...................................................................... 2059.5
  p95: ......................................................................... 5944.6
  p99: ......................................................................... 7260.8
vusers.completed: .............................................................. 980
vusers.created: ................................................................ 990
vusers.created_by_name.DB Storage: ............................................. 990
vusers.failed: ................................................................. 10
vusers.session_length:
  min: ......................................................................... 838.8
  max: ......................................................................... 9956.5
  mean: ........................................................................ 4892.3
  median: ...................................................................... 5487.5
  p95: ......................................................................... 8024.5
  p99: ......................................................................... 9047.6