tukano-artillery-tests/logs/delete-postgres-5.txt
--------------------------------
Summary report @ 16:05:32(+0000)
--------------------------------

http.codes.200: ................................................................ 150
http.downloaded_bytes: ......................................................... 12882
http.request_rate: ............................................................. 4/sec
http.requests: ................................................................. 150
http.response_time:
  min: ......................................................................... 414
  max: ......................................................................... 919
  mean: ........................................................................ 522.7
  median: ...................................................................... 518.1
  p95: ......................................................................... 713.5
  p99: ......................................................................... 837.3
http.response_time.2xx:
  min: ......................................................................... 414
  max: ......................................................................... 919
  mean: ........................................................................ 522.7
  median: ...................................................................... 518.1
  p95: ......................................................................... 713.5
  p99: ......................................................................... 837.3
http.responses: ................................................................ 150
plugins.metrics-by-endpoint./rest/users/{{ userId }}?pwd=pwd.codes.200: ........ 150
plugins.metrics-by-endpoint.response_time./rest/users/{{ userId }}?pwd=pwd:
  min: ......................................................................... 414
  max: ......................................................................... 919
  mean: ........................................................................ 522.7
  median: ...................................................................... 518.1
  p95: ......................................................................... 713.5
  p99: ......................................................................... 837.3
vusers.completed: .............................................................. 150
vusers.created: ................................................................ 150
vusers.created_by_name.DB Storage: ............................................. 150
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 845.6
  max: ......................................................................... 6154.7
  mean: ........................................................................ 1419.6
  median: ...................................................................... 963.1
  p95: ......................................................................... 4492.8
  p99: ......................................................................... 5711.5