tukano-artillery-tests/logs/filesystem-blobs-33.txt
--------------------------------
Summary report @ 23:50:01(+0000)
--------------------------------

http.codes.200: ................................................................ 1980
http.codes.204: ................................................................ 1980
http.downloaded_bytes: ......................................................... 282756
http.request_rate: ............................................................. 123/sec
http.requests: ................................................................. 3960
http.response_time:
  min: ......................................................................... 73
  max: ......................................................................... 309
  mean: ........................................................................ 144.7
  median: ...................................................................... 141.2
  p95: ......................................................................... 172.5
  p99: ......................................................................... 206.5
http.response_time.2xx:
  min: ......................................................................... 73
  max: ......................................................................... 309
  mean: ........................................................................ 144.7
  median: ...................................................................... 141.2
  p95: ......................................................................... 172.5
  p99: ......................................................................... 206.5
http.responses: ................................................................ 3960
plugins.metrics-by-endpoint./rest/blobs/{{ id }}?token=token.codes.200: ........ 990
plugins.metrics-by-endpoint./rest/blobs/{{ id }}?token=token.codes.204: ........ 990
plugins.metrics-by-endpoint./rest/blobs/{{ userId }}?token=token.codes.204: .... 990
plugins.metrics-by-endpoint./rest/shorts/{{ userId }}?pwd=pwd.codes.200: ....... 990
plugins.metrics-by-endpoint.response_time./rest/blobs/{{ id }}?token=token:
  min: ......................................................................... 85
  max: ......................................................................... 291
  mean: ........................................................................ 144.5
  median: ...................................................................... 141.2
  p95: ......................................................................... 172.5
  p99: ......................................................................... 210.6
plugins.metrics-by-endpoint.response_time./rest/blobs/{{ userId }}?token=token:
  min: ......................................................................... 114
  max: ......................................................................... 309
  mean: ........................................................................ 145.8
  median: ...................................................................... 141.2
  p95: ......................................................................... 179.5
  p99: ......................................................................... 214.9
plugins.metrics-by-endpoint.response_time./rest/shorts/{{ userId }}?pwd=pwd:
  min: ......................................................................... 73
  max: ......................................................................... 241
  mean: ........................................................................ 144
  median: ...................................................................... 141.2
  p95: ......................................................................... 169
  p99: ......................................................................... 186.8
vusers.completed: .............................................................. 990
vusers.created: ................................................................ 990
vusers.created_by_name.Blobs: .................................................. 990
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 966.7
  max: ......................................................................... 1422.9
  mean: ........................................................................ 1047.2
  median: ...................................................................... 1022.7
  p95: ......................................................................... 1176.4
  p99: ......................................................................... 1300.1